nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso51u68/project_template/pin_mux.h
/*
 * Copyright 2017-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#define PIO023_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO023_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO024_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */

/*! @name FC1_RTS_SCL_SSEL1 (number 1), J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL */
/* Routed pin properties */
#define BOARD_LINK2MCU_SCL_PERIPHERAL                                  FLEXCOMM1   /*!<@brief Peripheral name */
#define BOARD_LINK2MCU_SCL_SIGNAL                                  RTS_SCL_SSEL1   /*!<@brief Signal name */
#define BOARD_LINK2MCU_SCL_PIN_NAME                            FC1_RTS_SCL_SSEL1   /*!<@brief Routed pin name */
#define BOARD_LINK2MCU_SCL_LABEL "J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL"   /*!<@brief Label */
#define BOARD_LINK2MCU_SCL_NAME                                   "LINK2MCU_SCL"   /*!<@brief Identifier */
#define BOARD_LINK2MCU_SCL_PORT                                               0U   /*!<@brief PORT device index: 0 */
#define BOARD_LINK2MCU_SCL_PIN                                               23U   /*!<@brief PORT pin number */
#define BOARD_LINK2MCU_SCL_PIN_MASK                                  (1U << 23U)   /*!<@brief PORT pin mask */

/*! @name FC1_CTS_SDA_SSEL0 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */
/* Routed pin properties */
#define BOARD_LINK2MCU_SDA_PERIPHERAL                                  FLEXCOMM1   /*!<@brief Peripheral name */
#define BOARD_LINK2MCU_SDA_SIGNAL                                  CTS_SDA_SSEL0   /*!<@brief Signal name */
#define BOARD_LINK2MCU_SDA_PIN_NAME                            FC1_CTS_SDA_SSEL0   /*!<@brief Routed pin name */
#define BOARD_LINK2MCU_SDA_LABEL "J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP" /*!<@brief Label */
#define BOARD_LINK2MCU_SDA_NAME                                   "LINK2MCU_SDA"   /*!<@brief Identifier */
#define BOARD_LINK2MCU_SDA_PORT                                               0U   /*!<@brief PORT device index: 0 */
#define BOARD_LINK2MCU_SDA_PIN                                               24U   /*!<@brief PORT pin number */
#define BOARD_LINK2MCU_SDA_PIN_MASK                                  (1U << 24U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLink2MCUPins(void); /* Function assigned for the Cortex-M0P */

#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO031_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO031_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO04_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_24 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */
/* Routed pin properties */
#define BOARD_SW1_PERIPHERAL                                                GPIO   /*!<@brief Peripheral name */
#define BOARD_SW1_SIGNAL                                                    PIO0   /*!<@brief Signal name */
#define BOARD_SW1_CHANNEL                                                     24   /*!<@brief Signal channel */
#define BOARD_SW1_PIN_NAME                                               PIO0_24   /*!<@brief Routed pin name */
#define BOARD_SW1_LABEL "J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP" /*!<@brief Label */
#define BOARD_SW1_NAME                                                     "SW1"   /*!<@brief Identifier */
#define BOARD_SW1_DIRECTION                              kPIN_MUX_DirectionInput   /*!<@brief Direction */

