nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso51u68/project_template/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_SW1_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW1_GPIO_PIN                                                   24U   /*!<@brief GPIO pin number */
#define BOARD_SW1_GPIO_PIN_MASK                                      (1U << 24U)   /*!<@brief GPIO pin mask */
#define BOARD_SW1_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW1_PIN                                                        24U   /*!<@brief PORT pin number */
#define BOARD_SW1_PIN_MASK                                           (1U << 24U)   /*!<@brief PORT pin mask */

/*! @name PIO0_31 (number 13), J2[17]/J3[2]/P1[7]/U3[4]/SW2/P0_31-PDM0_CLK-ISP0_EN */
/* Routed pin properties */
#define BOARD_SW2_PERIPHERAL                                                GPIO   /*!<@brief Peripheral name */
#define BOARD_SW2_SIGNAL                                                    PIO0   /*!<@brief Signal name */
#define BOARD_SW2_CHANNEL                                                     31   /*!<@brief Signal channel */
#define BOARD_SW2_PIN_NAME                                               PIO0_31   /*!<@brief Routed pin name */
#define BOARD_SW2_LABEL    "J2[17]/J3[2]/P1[7]/U3[4]/SW2/P0_31-PDM0_CLK-ISP0_EN"   /*!<@brief Label */
#define BOARD_SW2_NAME                                                     "SW2"   /*!<@brief Identifier */
#define BOARD_SW2_DIRECTION                              kPIN_MUX_DirectionInput   /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SW2_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW2_GPIO_PIN                                                   31U   /*!<@brief GPIO pin number */
#define BOARD_SW2_GPIO_PIN_MASK                                      (1U << 31U)   /*!<@brief GPIO pin mask */
#define BOARD_SW2_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW2_PIN                                                        31U   /*!<@brief PORT pin number */
#define BOARD_SW2_PIN_MASK                                           (1U << 31U)   /*!<@brief PORT pin mask */

/*! @name PIO0_4 (number 38), J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1 */
/* Routed pin properties */
#define BOARD_SW3_PERIPHERAL                                                GPIO   /*!<@brief Peripheral name */
#define BOARD_SW3_SIGNAL                                                    PIO0   /*!<@brief Signal name */
#define BOARD_SW3_CHANNEL                                                      4   /*!<@brief Signal channel */
#define BOARD_SW3_PIN_NAME                                                PIO0_4   /*!<@brief Routed pin name */
#define BOARD_SW3_LABEL                    "J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1"   /*!<@brief Label */
#define BOARD_SW3_NAME                                                     "SW3"   /*!<@brief Identifier */
#define BOARD_SW3_DIRECTION                              kPIN_MUX_DirectionInput   /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_SW3_GPIO                                                      GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_SW3_GPIO_PIN                                                    4U   /*!<@brief GPIO pin number */
#define BOARD_SW3_GPIO_PIN_MASK                                       (1U << 4U)   /*!<@brief GPIO pin mask */
#define BOARD_SW3_PORT                                                        0U   /*!<@brief PORT device index: 0 */
#define BOARD_SW3_PIN                                                         4U   /*!<@brief PORT pin number */
#define BOARD_SW3_PIN_MASK                                            (1U << 4U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M0P */

#define PIO029_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO029_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO110_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO110_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO19_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO19_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO1_9 (number 29), J9[5]/D2[3]/P1_9-BLUE_LED */
/* Routed pin properties */
#define BOARD_LED_BLUE_PERIPHERAL                                           GPIO   /*!<@brief Peripheral name */
#define BOARD_LED_BLUE_SIGNAL                                               PIO1   /*!<@brief Signal name */
#define BOARD_LED_BLUE_CHANNEL                                                 9   /*!<@brief Signal channel */
#define BOARD_LED_BLUE_PIN_NAME                                           PIO1_9   /*!<@brief Routed pin name */
#define BOARD_LED_BLUE_LABEL                         "J9[5]/D2[3]/P1_9-BLUE_LED"   /*!<@brief Label */
#define BOARD_LED_BLUE_NAME                                           "LED_BLUE"   /*!<@brief Identifier */
#define BOARD_LED_BLUE_DIRECTION                        kPIN_MUX_DirectionOutput   /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_BLUE_GPIO                                                 GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_BLUE_GPIO_PIN                                               9U   /*!<@brief GPIO pin number */
#define BOARD_LED_BLUE_GPIO_PIN_MASK                                  (1U << 9U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_BLUE_PORT                                                   1U   /*!<@brief PORT device index: 1 */
#define BOARD_LED_BLUE_PIN                                                    9U   /*!<@brief PORT pin number */
#define BOARD_LED_BLUE_PIN_MASK                                       (1U << 9U)   /*!<@brief PORT pin mask */

/*! @name PIO1_10 (number 30), J9[8]/D2[4]/P1_10-SCT4-LED_GREEN */
/* Routed pin properties */
#define BOARD_LED_GREEN_PERIPHERAL                                          GPIO   /*!<@brief Peripheral name */
#define BOARD_LED_GREEN_SIGNAL                                              PIO1   /*!<@brief Signal name */
#define BOARD_LED_GREEN_CHANNEL                                               10   /*!<@brief Signal channel */
#define BOARD_LED_GREEN_PIN_NAME                                         PIO1_10   /*!<@brief Routed pin name */
#define BOARD_LED_GREEN_LABEL                 "J9[8]/D2[4]/P1_10-SCT4-LED_GREEN"   /*!<@brief Label */
#define BOARD_LED_GREEN_NAME                                         "LED_GREEN"   /*!<@brief Identifier */
#define BOARD_LED_GREEN_DIRECTION                       kPIN_MUX_DirectionOutput   /*!<@brief Direction */

