nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso51u68/project_template/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LED_GREEN_GPIO                                                GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_GREEN_GPIO_PIN                                             10U   /*!<@brief GPIO pin number */
#define BOARD_LED_GREEN_GPIO_PIN_MASK                                (1U << 10U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_GREEN_PORT                                                  1U   /*!<@brief PORT device index: 1 */
#define BOARD_LED_GREEN_PIN                                                  10U   /*!<@brief PORT pin number */
#define BOARD_LED_GREEN_PIN_MASK                                     (1U << 10U)   /*!<@brief PORT pin mask */

/*! @name PIO0_29 (number 11), J2[5]/D2[1]/P0_29-CT32B0_MAT3-RED */
/* Routed pin properties */
#define BOARD_LED_RED_PERIPHERAL                                            GPIO   /*!<@brief Peripheral name */
#define BOARD_LED_RED_SIGNAL                                                PIO0   /*!<@brief Signal name */
#define BOARD_LED_RED_CHANNEL                                                 29   /*!<@brief Signal channel */
#define BOARD_LED_RED_PIN_NAME                                           PIO0_29   /*!<@brief Routed pin name */
#define BOARD_LED_RED_LABEL                  "J2[5]/D2[1]/P0_29-CT32B0_MAT3-RED"   /*!<@brief Label */
#define BOARD_LED_RED_NAME                                             "LED_RED"   /*!<@brief Identifier */
#define BOARD_LED_RED_DIRECTION                         kPIN_MUX_DirectionOutput   /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_LED_RED_GPIO                                                  GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_LED_RED_GPIO_PIN                                               29U   /*!<@brief GPIO pin number */
#define BOARD_LED_RED_GPIO_PIN_MASK                                  (1U << 29U)   /*!<@brief GPIO pin mask */
#define BOARD_LED_RED_PORT                                                    0U   /*!<@brief PORT device index: 0 */
#define BOARD_LED_RED_PIN                                                    29U   /*!<@brief PORT pin number */
#define BOARD_LED_RED_PIN_MASK                                       (1U << 29U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M0P */

#define PIO025_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO025_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO025_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO026_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO026_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO026_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */

/*! @name FC4_RTS_SCL_SSEL1 (number 3), J1[1]/JS4[1]/U10[7]/P0_25-FC4_SCLX */
/* Routed pin properties */
#define BOARD_FC4_SCLX_PERIPHERAL                                      FLEXCOMM4   /*!<@brief Peripheral name */
#define BOARD_FC4_SCLX_SIGNAL                                      RTS_SCL_SSEL1   /*!<@brief Signal name */
#define BOARD_FC4_SCLX_PIN_NAME                                FC4_RTS_SCL_SSEL1   /*!<@brief Routed pin name */
#define BOARD_FC4_SCLX_LABEL                "J1[1]/JS4[1]/U10[7]/P0_25-FC4_SCLX"   /*!<@brief Label */
#define BOARD_FC4_SCLX_NAME                                           "FC4_SCLX"   /*!<@brief Identifier */
#define BOARD_FC4_SCLX_PORT                                                   0U   /*!<@brief PORT device index: 0 */
#define BOARD_FC4_SCLX_PIN                                                   25U   /*!<@brief PORT pin number */
#define BOARD_FC4_SCLX_PIN_MASK                                      (1U << 25U)   /*!<@brief PORT pin mask */

/*! @name FC4_CTS_SDA_SSEL0 (number 4), J1[3]/JS5[1]/U10[5]/P0_26-FC4_SDAX */
/* Routed pin properties */
#define BOARD_FC4_SDAX_PERIPHERAL                                      FLEXCOMM4   /*!<@brief Peripheral name */
#define BOARD_FC4_SDAX_SIGNAL                                      CTS_SDA_SSEL0   /*!<@brief Signal name */
#define BOARD_FC4_SDAX_PIN_NAME                                FC4_CTS_SDA_SSEL0   /*!<@brief Routed pin name */
#define BOARD_FC4_SDAX_LABEL                "J1[3]/JS5[1]/U10[5]/P0_26-FC4_SDAX"   /*!<@brief Label */
#define BOARD_FC4_SDAX_NAME                                           "FC4_SDAX"   /*!<@brief Identifier */
#define BOARD_FC4_SDAX_PORT                                                   0U   /*!<@brief PORT device index: 0 */
#define BOARD_FC4_SDAX_PIN                                                   26U   /*!<@brief PORT pin number */
#define BOARD_FC4_SDAX_PIN_MASK                                      (1U << 26U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSecureMCUPins(void); /* Function assigned for the Cortex-M0P */

#define PIO018_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO018_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO019_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO019_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO020_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO020_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO12_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO12_FUNC_ALT4                                                    0x04u   /*!<@brief Selects pin function.: Alternative connection 4. */

