nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso51u68/project_template/pin_mux.h
/*! @name FC5_TXD_SCL_MISO (number 58), J1[11]/U5[2]/P0_18-FC5_TXD_SCL_MISO */
/* Routed pin properties */
#define BOARD_SPI_FLASH_MISO_PERIPHERAL                                FLEXCOMM5   /*!<@brief Peripheral name */
#define BOARD_SPI_FLASH_MISO_SIGNAL                                 TXD_SCL_MISO   /*!<@brief Signal name */
#define BOARD_SPI_FLASH_MISO_PIN_NAME                           FC5_TXD_SCL_MISO   /*!<@brief Routed pin name */
#define BOARD_SPI_FLASH_MISO_LABEL         "J1[11]/U5[2]/P0_18-FC5_TXD_SCL_MISO"   /*!<@brief Label */
#define BOARD_SPI_FLASH_MISO_NAME                               "SPI_FLASH_MISO"   /*!<@brief Identifier */
#define BOARD_SPI_FLASH_MISO_PORT                                             0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_MISO_PIN                                             18U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_MISO_PIN_MASK                                (1U << 18U)   /*!<@brief PORT pin mask */

/*! @name FC5_SCK (number 59), J1[9]/J2[8]/U5[6]/P0_19-FC5_SCK-SPIFI_CSn */
/* Routed pin properties */
#define BOARD_SPI_FLASH_SCK_PERIPHERAL                                 FLEXCOMM5   /*!<@brief Peripheral name */
#define BOARD_SPI_FLASH_SCK_SIGNAL                                           SCK   /*!<@brief Signal name */
#define BOARD_SPI_FLASH_SCK_PIN_NAME                                     FC5_SCK   /*!<@brief Routed pin name */
#define BOARD_SPI_FLASH_SCK_LABEL    "J1[9]/J2[8]/U5[6]/P0_19-FC5_SCK-SPIFI_CSn"   /*!<@brief Label */
#define BOARD_SPI_FLASH_SCK_NAME                                 "SPI_FLASH_SCK"   /*!<@brief Identifier */
#define BOARD_SPI_FLASH_SCK_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_SCK_PIN                                              19U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_SCK_PIN_MASK                                 (1U << 19U)   /*!<@brief PORT pin mask */

/*! @name FC5_RXD_SDA_MOSI (number 60), J1[13]/U5[5]/P0_20-FC5_RXD_SDA_MOSI */
/* Routed pin properties */
#define BOARD_SPI_FLASH_MOSI_PERIPHERAL                                FLEXCOMM5   /*!<@brief Peripheral name */
#define BOARD_SPI_FLASH_MOSI_SIGNAL                                 RXD_SDA_MOSI   /*!<@brief Signal name */
#define BOARD_SPI_FLASH_MOSI_PIN_NAME                           FC5_RXD_SDA_MOSI   /*!<@brief Routed pin name */
#define BOARD_SPI_FLASH_MOSI_LABEL         "J1[13]/U5[5]/P0_20-FC5_RXD_SDA_MOSI"   /*!<@brief Label */
#define BOARD_SPI_FLASH_MOSI_NAME                               "SPI_FLASH_MOSI"   /*!<@brief Identifier */
#define BOARD_SPI_FLASH_MOSI_PORT                                             0U   /*!<@brief PORT device index: 0 */
#define BOARD_SPI_FLASH_MOSI_PIN                                             20U   /*!<@brief PORT pin number */
#define BOARD_SPI_FLASH_MOSI_PIN_MASK                                (1U << 20U)   /*!<@brief PORT pin mask */

/*! @name FC5_SSEL3 (number 16), J9[7]/JS8[1]/U5[1]/P1_2-FC5_SSEL3 */
/* Routed pin properties */
#define BOARD_FC5_SSEL3_PERIPHERAL                                     FLEXCOMM5   /*!<@brief Peripheral name */
#define BOARD_FC5_SSEL3_SIGNAL                                             SSEL3   /*!<@brief Signal name */
#define BOARD_FC5_SSEL3_PIN_NAME                                       FC5_SSEL3   /*!<@brief Routed pin name */
#define BOARD_FC5_SSEL3_LABEL                "J9[7]/JS8[1]/U5[1]/P1_2-FC5_SSEL3"   /*!<@brief Label */
#define BOARD_FC5_SSEL3_NAME                                         "FC5_SSEL3"   /*!<@brief Identifier */
#define BOARD_FC5_SSEL3_PORT                                                  1U   /*!<@brief PORT device index: 1 */
#define BOARD_FC5_SSEL3_PIN                                                   2U   /*!<@brief PORT pin number */
#define BOARD_FC5_SSEL3_PIN_MASK                                      (1U << 2U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSPI_FLASHPins(void); /* Function assigned for the Cortex-M0P */

#define PIO011_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO011_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO012_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO012_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO013_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO013_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO014_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO014_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO022_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO022_FUNC_ALT0                                                   0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */
#define PIO023_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO023_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO023_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO024_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO024_FUNC_ALT1                                                   0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO024_I2CSLEW_I2C_MODE                                            0x00u   /*!<@brief Controls slew rate of I2C pin.: I2C mode. */
#define PIO04_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO04_FUNC_ALT0                                                    0x00u   /*!<@brief Selects pin function.: Alternative connection 0. */

/*! @name PIO0_4 (number 38), J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1 */
/* Routed pin properties */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_PERIPHERAL          GPIO   /*!<@brief Peripheral name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_SIGNAL              PIO0   /*!<@brief Signal name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_CHANNEL                4   /*!<@brief Signal channel */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_PIN_NAME          PIO0_4   /*!<@brief Routed pin name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_LABEL "J4[7]/U9[12]/SW3/BRIDGE_T_INTR-ISP1" /*!<@brief Label */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_T_INTR_NAME     "BRIDGE_T_INTR"   /*!<@brief Identifier */

