nxp-mcuxpresso/mcux-sdk/boards/lpcxpresso51u68/project_template/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_GPIO                  GPIO   /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_GPIO_PIN               22U   /*!<@brief GPIO pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_GPIO_PIN_MASK  (1U << 22U)   /*!<@brief GPIO pin mask */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PORT                    0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PIN                    22U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_GPIO_PIN_MASK       (1U << 22U)   /*!<@brief PORT pin mask */

/*! @name FC1_RTS_SCL_SSEL1 (number 1), J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL */
/* Routed pin properties */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PERIPHERAL        FLEXCOMM1   /*!<@brief Peripheral name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_SIGNAL        RTS_SCL_SSEL1   /*!<@brief Signal name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PIN_NAME  FC1_RTS_SCL_SSEL1   /*!<@brief Routed pin name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_LABEL "J4[9]/JS3[1]/JS4[3]/U10[7]/U12[D6]/BRIDGE_SCL" /*!<@brief Label */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_NAME           "BRIDGE_SCL"   /*!<@brief Identifier */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PORT                     0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PIN                     23U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SCL_PIN_MASK        (1U << 23U)   /*!<@brief PORT pin mask */

/*! @name FC1_CTS_SDA_SSEL0 (number 2), J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP */
/* Routed pin properties */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PERIPHERAL FLEXCOMM1   /*!<@brief Peripheral name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_SIGNAL CTS_SDA_SSEL0   /*!<@brief Signal name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PIN_NAME FC1_CTS_SDA_SSEL0 /*!<@brief Routed pin name */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_LABEL "J4[10]/JS2[1]/JS5[3]/U10[5]/U12[E6]/SW1/BRIDGE_SDA-WAKEUP" /*!<@brief Label */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_NAME "BRIDGE_SDA_WAKEUP" /*!<@brief Identifier */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PORT              0U   /*!<@brief PORT device index: 0 */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PIN              24U   /*!<@brief PORT pin number */
#define BOARD_INITPMOD_SPI_I2C_BRIDGEPINS_BRIDGE_SDA_WAKEUP_PIN_MASK (1U << 24U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C_BRIDGEPins(void); /* Function assigned for the Cortex-M0P */

#define PIO16_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO16_FUNC_ALT7                                                    0x07u   /*!<@brief Selects pin function.: Alternative connection 7. */

/*! @name USB0_DP (number 5), J5[3]/U7[2]/USB_DP */
/* Routed pin properties */
#define BOARD_USB_DP_PERIPHERAL                                             USB0   /*!<@brief Peripheral name */
#define BOARD_USB_DP_SIGNAL                                               USB_DP   /*!<@brief Signal name */
#define BOARD_USB_DP_PIN_NAME                                            USB0_DP   /*!<@brief Routed pin name */
#define BOARD_USB_DP_LABEL                                  "J5[3]/U7[2]/USB_DP"   /*!<@brief Label */
#define BOARD_USB_DP_NAME                                               "USB_DP"   /*!<@brief Identifier */

/*! @name USB0_DM (number 6), J5[2]/U7[3]/USB_DM */
/* Routed pin properties */
#define BOARD_USB_DM_PERIPHERAL                                             USB0   /*!<@brief Peripheral name */
#define BOARD_USB_DM_SIGNAL                                               USB_DM   /*!<@brief Signal name */
#define BOARD_USB_DM_PIN_NAME                                            USB0_DM   /*!<@brief Routed pin name */
#define BOARD_USB_DM_LABEL                                  "J5[2]/U7[3]/USB_DM"   /*!<@brief Label */
#define BOARD_USB_DM_NAME                                               "USB_DM"   /*!<@brief Identifier */

/*! @name USB0_VBUS (number 26), J1[14]/J5[1]/JP10[2]/P1_6-FC7_SCK-USB_VBUS */
/* Routed pin properties */
#define BOARD_USB_VBUS_PERIPHERAL                                           USB0   /*!<@brief Peripheral name */
#define BOARD_USB_VBUS_SIGNAL                                           USB_VBUS   /*!<@brief Signal name */
#define BOARD_USB_VBUS_PIN_NAME                                        USB0_VBUS   /*!<@brief Routed pin name */
#define BOARD_USB_VBUS_LABEL        "J1[14]/J5[1]/JP10[2]/P1_6-FC7_SCK-USB_VBUS"   /*!<@brief Label */
#define BOARD_USB_VBUS_NAME                                           "USB_VBUS"   /*!<@brief Identifier */
#define BOARD_USB_VBUS_PORT                                                   1U   /*!<@brief PORT device index: 1 */
#define BOARD_USB_VBUS_PIN                                                    6U   /*!<@brief PORT pin number */
#define BOARD_USB_VBUS_PIN_MASK                                       (1U << 6U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M0P */

#define PIO00_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO00_FUNC_ALT1                                                    0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */
#define PIO01_DIGIMODE_DIGITAL                                             0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO01_FUNC_ALT1                                                    0x01u   /*!<@brief Selects pin function.: Alternative connection 1. */

/*! @name FC0_TXD_SCL_MISO (number 32), U6[4]/U22[3]/P0_1-ISP_TX */
/* Routed pin properties */
#define BOARD_DEBUG_UART_TX_PERIPHERAL                                 FLEXCOMM0   /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_TX_SIGNAL                                  TXD_SCL_MISO   /*!<@brief Signal name */
#define BOARD_DEBUG_UART_TX_PIN_NAME                            FC0_TXD_SCL_MISO   /*!<@brief Routed pin name */
#define BOARD_DEBUG_UART_TX_LABEL                     "U6[4]/U22[3]/P0_1-ISP_TX"   /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME                                 "DEBUG_UART_TX"   /*!<@brief Identifier */
#define BOARD_DEBUG_UART_TX_DIRECTION                   kPIN_MUX_DirectionOutput   /*!<@brief Direction */
#define BOARD_DEBUG_UART_TX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_TX_PIN                                               1U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_TX_PIN_MASK                                  (1U << 1U)   /*!<@brief PORT pin mask */

/*! @name FC0_RXD_SDA_MOSI (number 31), U18[4]/TO_MUX_P0_0-ISP_RX */
/* Routed pin properties */
#define BOARD_DEBUG_UART_RX_PERIPHERAL                                 FLEXCOMM0   /*!<@brief Peripheral name */
#define BOARD_DEBUG_UART_RX_SIGNAL                                  RXD_SDA_MOSI   /*!<@brief Signal name */
#define BOARD_DEBUG_UART_RX_PIN_NAME                            FC0_RXD_SDA_MOSI   /*!<@brief Routed pin name */
#define BOARD_DEBUG_UART_RX_LABEL                    "U18[4]/TO_MUX_P0_0-ISP_RX"   /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME                                 "DEBUG_UART_RX"   /*!<@brief Identifier */
#define BOARD_DEBUG_UART_RX_DIRECTION                    kPIN_MUX_DirectionInput   /*!<@brief Direction */
#define BOARD_DEBUG_UART_RX_PORT                                              0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_UART_RX_PIN                                               0U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_UART_RX_PIN_MASK                                  (1U << 0U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M0P */

#define PIO016_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO016_FUNC_ALT5                                                   0x05u   /*!<@brief Selects pin function.: Alternative connection 5. */
#define PIO017_DIGIMODE_DIGITAL                                            0x01u   /*!<@brief Select Analog/Digital mode.: Digital mode. */
#define PIO017_FUNC_ALT5                                                   0x05u   /*!<@brief Selects pin function.: Alternative connection 5. */

/*! @name SWDIO (number 53), J2[6]/P1[2]/U2[5]/U14[4]/IF_TMS_SWDIO-SPIFI_IO0 */
/* Routed pin properties */
#define BOARD_DEBUG_SWD_SWDIO_PERIPHERAL                                     SWD   /*!<@brief Peripheral name */
#define BOARD_DEBUG_SWD_SWDIO_SIGNAL                                       SWDIO   /*!<@brief Signal name */
#define BOARD_DEBUG_SWD_SWDIO_PIN_NAME                                     SWDIO   /*!<@brief Routed pin name */
#define BOARD_DEBUG_SWD_SWDIO_LABEL "J2[6]/P1[2]/U2[5]/U14[4]/IF_TMS_SWDIO-SPIFI_IO0" /*!<@brief Label */
#define BOARD_DEBUG_SWD_SWDIO_NAME                             "DEBUG_SWD_SWDIO"   /*!<@brief Identifier */
#define BOARD_DEBUG_SWD_SWDIO_PORT                                            0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_SWD_SWDIO_PIN                                            17U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_SWD_SWDIO_PIN_MASK                               (1U << 17U)   /*!<@brief PORT pin mask */

/*! @name SWCLK (number 52), J2[4]/JS28/U4[4]/TCK-SWDCLK_TRGT-SPIFI_IO1 */
/* Routed pin properties */
#define BOARD_DEBUG_SWD_SWDCLK_PERIPHERAL                                    SWD   /*!<@brief Peripheral name */
#define BOARD_DEBUG_SWD_SWDCLK_SIGNAL                                      SWCLK   /*!<@brief Signal name */
#define BOARD_DEBUG_SWD_SWDCLK_PIN_NAME                                    SWCLK   /*!<@brief Routed pin name */
#define BOARD_DEBUG_SWD_SWDCLK_LABEL "J2[4]/JS28/U4[4]/TCK-SWDCLK_TRGT-SPIFI_IO1"  /*!<@brief Label */
#define BOARD_DEBUG_SWD_SWDCLK_NAME                           "DEBUG_SWD_SWDCLK"   /*!<@brief Identifier */
#define BOARD_DEBUG_SWD_SWDCLK_PORT                                           0U   /*!<@brief PORT device index: 0 */
#define BOARD_DEBUG_SWD_SWDCLK_PIN                                           16U   /*!<@brief PORT pin number */
#define BOARD_DEBUG_SWD_SWDCLK_PIN_MASK                              (1U << 16U)   /*!<@brief PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
